Repository: astralchen/AzureFish
Catalog: AzureFish/Localizable.xcstrings
Source language: en
Languages: ar, zh_hans, zh_hant

# account.design.back
source: Back
ar: رجوع
zh_hans: 返回
zh_hant: 返回

# account.design.backWelcome
source: Back to welcome
ar: العودة إلى الترحيب
zh_hans: 返回欢迎页
zh_hant: 返回歡迎頁

# account.design.bindApple
source: Link Apple
ar: ربط Apple
zh_hans: 绑定 Apple
zh_hant: 連結 Apple

# account.design.bio
source: Bio
ar: نبذة
zh_hans: 简介
zh_hant: 簡介

# account.design.bioRule
source: Up to 500 characters. Leave empty to clear your bio.
ar: حتى 500 حرف. اترك الحقل فارغًا لمسح النبذة.
zh_hans: 最多 500 个字符。留空可清除简介。
zh_hant: 最多 500 個字元。留白可清除簡介。

# account.design.bound
source: Linked
ar: مرتبط
zh_hans: 已绑定
zh_hant: 已連結

# account.design.cancel
source: Cancel
ar: إلغاء
zh_hans: 取消
zh_hant: 取消

# account.design.changePassword
source: Change password
ar: تغيير كلمة المرور
zh_hans: 修改密码
zh_hant: 更改密碼

# account.design.changePasswordHelp
source: Changing your password signs out every device, including this one.
ar: سيؤدي تغيير كلمة المرور إلى تسجيل الخروج من جميع الأجهزة، بما فيها هذا الجهاز.
zh_hans: 修改成功后，所有设备都会退出登录，包括当前设备。
zh_hant: 更改成功後，所有裝置都會登出，包含目前裝置。

# account.design.changePhoto
source: Change photo
ar: تغيير الصورة
zh_hans: 更换头像
zh_hant: 更換頭像

# account.design.chat
source: Chat
ar: المحادثات
zh_hans: 聊天
zh_hant: 聊天

# account.design.choosePhoto
source: Choose photo
ar: اختيار صورة
zh_hans: 选择照片
zh_hant: 選擇照片

# account.design.completeHelp
source: Add your name, photo and bio. You can finish later.
ar: أضف اسمك وصورتك ونبذة عنك، أو أكمل ذلك لاحقًا.
zh_hans: 设置昵称、头像和简介，也可以稍后完成。
zh_hant: 設定暱稱、頭像和簡介，也可以稍後完成。

# account.design.completeProfile
source: Complete your profile
ar: أكمل ملفك الشخصي
zh_hans: 完善个人资料
zh_hant: 完善個人資料

# account.design.confirmIdentity
source: Confirm identity
ar: تأكيد الهوية
zh_hans: 确认身份
zh_hant: 確認身分

# account.design.confirmPassword
source: Confirm password
ar: تأكيد كلمة المرور
zh_hans: 确认密码
zh_hant: 確認密碼

# account.design.conflictHelp
source: Your edits are retained. Load the latest profile, then review and save again.
ar: لم تفقد تعديلاتك. حمّل أحدث نسخة ثم راجع التغييرات واحفظها مجددًا.
zh_hans: 你的编辑仍保留。载入最新资料后，可以重新确认并保存。
zh_hant: 你的編輯仍保留。載入最新資料後，可以重新確認並儲存。

# account.design.conflictTitle
source: Profile updated elsewhere
ar: تم تحديث الملف على جهاز آخر
zh_hans: 资料已在其他设备更新
zh_hant: 資料已在其他裝置更新

# account.design.continue
source: Continue
ar: متابعة
zh_hans: 继续
zh_hant: 繼續

# account.design.dark
source: Dark
ar: داكن
zh_hans: 深色
zh_hant: 深色

# account.design.deleteAccepted
source: Deletion request accepted
ar: تم قبول طلب الحذف
zh_hans: 删除申请已受理
zh_hant: 刪除申請已受理

# account.design.deleteAcceptedHelp
source: You’ve been signed out. The server is processing the remaining cleanup.
ar: تم تسجيل خروجك. يعالج الخادم عمليات التنظيف المتبقية.
zh_hans: 账号已退出。服务器正在处理后续清理。
zh_hant: 帳號已登出。伺服器正在處理後續清理。

# account.design.deleteAccount
source: Delete account
ar: حذف الحساب
zh_hans: 删除账号
zh_hant: 刪除帳號

# account.design.deleteConfirm
source: Confirm deletion
ar: تأكيد الحذف
zh_hans: 确认删除
zh_hant: 確認刪除

# account.design.deleteFinal
source: Delete this account?
ar: هل تريد حذف الحساب؟
zh_hans: 确认删除账号？
zh_hant: 確認刪除帳號？

# account.design.deleteHelp
source: Your account and profile will be removed. This cannot be undone. Review before continuing.
ar: سيُحذف حسابك وملفك الشخصي. لا يمكن التراجع عن هذا الإجراء. راجع قبل المتابعة.
zh_hans: 账号和个人资料将被清除，此操作无法撤销。请确认后继续。
zh_hant: 帳號與個人資料將被清除，此操作無法復原。請確認後繼續。

# account.design.demoBio
source: Little moments, shared along the way.
ar: لحظات صغيرة نشاركها معًا.
zh_hans: 把日常，慢慢说给你听。
zh_hant: 把日常，慢慢說給你聽。

# account.design.demoHelp
source: Chat uses simulated local replies. Live messaging is not connected.
ar: تستخدم المحادثة ردودًا محلية محاكية. المراسلة الفعلية غير متصلة.
zh_hans: 聊天使用本地模拟回复，尚未接入真实 IM。
zh_hant: 聊天使用本機模擬回覆，尚未串接真實 IM。

# account.design.demoName
source: Little Fish
ar: سمكة صغيرة
zh_hans: 小鱼
zh_hant: 小魚

# account.design.discard
source: Discard edits
ar: تجاهل التعديلات
zh_hans: 放弃修改
zh_hant: 放棄修改

# account.design.discardHelp
source: Unsaved text edits will be discarded. Confirmed photo changes remain.
ar: ستُلغى تعديلات النص غير المحفوظة. تبقى تغييرات الصورة المؤكدة.
zh_hans: 未保存的文字修改将被丢弃，已确认的头像更新不受影响。
zh_hant: 尚未儲存的文字修改將被捨棄，已確認的頭像更新不受影響。

# account.design.done
source: Done
ar: تم
zh_hans: 完成
zh_hant: 完成

# account.design.editProfile
source: Edit profile
ar: تعديل الملف
zh_hans: 编辑资料
zh_hant: 編輯資料

# account.design.enterAccount
source: Enter account name
ar: أدخل اسم الحساب
zh_hans: 请输入账号
zh_hant: 請輸入帳號

# account.design.enterBio
source: Tell us about yourself (optional)
ar: عرّف عن نفسك (اختياري)
zh_hans: 介绍一下自己（可选）
zh_hant: 介紹一下自己（選填）

# account.design.enterNickname
source: Enter display name
ar: أدخل الاسم الظاهر
zh_hans: 请输入昵称
zh_hant: 請輸入暱稱

# account.design.enterPassword
source: Enter password
ar: أدخل كلمة المرور
zh_hans: 请输入密码
zh_hant: 請輸入密碼

# account.design.hidePassword
source: Hide password
ar: إخفاء كلمة المرور
zh_hans: 隐藏密码
zh_hant: 隱藏密碼

# account.design.incomplete
source: Your profile is incomplete. Finish it whenever you’re ready.
ar: ملفك الشخصي غير مكتمل. يمكنك إكماله في أي وقت.
zh_hans: 个人资料尚未完善，随时可以继续。
zh_hant: 個人資料尚未完善，隨時可以繼續。

# account.design.keepEditing
source: Keep editing
ar: متابعة التعديل
zh_hans: 继续编辑
zh_hant: 繼續編輯

# account.design.language
source: Language
ar: اللغة
zh_hans: 语言
zh_hant: 語言

# account.design.languageHelp
source: Stored on this device. Switching language preserves your page and unsent input.
ar: يُحفظ الإعداد على هذا الجهاز. يحافظ تغيير اللغة على صفحتك والمدخلات غير المرسلة.
zh_hans: 语言设置仅保存在本机。切换后保留当前页面和未提交输入。
zh_hant: 語言設定僅儲存在本機。切換後保留目前頁面及尚未送出的輸入。

# account.design.later
source: Later
ar: لاحقًا
zh_hans: 稍后
zh_hant: 稍後

# account.design.light
source: Light
ar: فاتح
zh_hans: 浅色
zh_hant: 淺色

# account.design.loading
source: Loading…
ar: جارٍ التحميل…
zh_hans: 正在加载…
zh_hant: 正在載入…

# account.design.localDemo
source: Local demo
ar: عرض محلي تجريبي
zh_hans: 本地演示
zh_hant: 本機示範

# account.design.localLogout
source: Sign out locally
ar: الخروج محليًا
zh_hans: 退出本机
zh_hant: 登出本機

# account.design.login
source: Sign in
ar: تسجيل الدخول
zh_hans: 账号登录
zh_hant: 帳號登入

# account.design.loginError
source: The account name or password is incorrect. Try again.
ar: اسم الحساب أو كلمة المرور غير صحيحة. حاول مجددًا.
zh_hans: 账号或密码不正确，请重试。
zh_hant: 帳號或密碼不正確，請重試。

# account.design.loginHelp
source: Use your account name and password.
ar: استخدم اسم حسابك وكلمة المرور.
zh_hans: 使用你的账号和密码登录。
zh_hant: 使用你的帳號和密碼登入。

# account.design.logoutHelp
source: Sign out on this device. Encrypted local data is retained.
ar: سيتم تسجيل الخروج من هذا الجهاز مع الاحتفاظ بالبيانات المحلية المشفرة.
zh_hans: 将退出当前设备，保留本机加密数据。
zh_hant: 將登出目前裝置，保留本機加密資料。

# account.design.logoutOffline
source: You’re offline. You can sign out locally; server sign-out is pending synchronization.
ar: أنت دون اتصال. يمكنك الخروج محليًا؛ تبقى مزامنة الخروج مع الخادم معلقة.
zh_hans: 当前离线，可先退出本机。服务端退出状态待同步。
zh_hant: 目前離線，可先登出本機。伺服器登出狀態待同步。

# account.design.me
source: Me
ar: أنا
zh_hans: 我
zh_hant: 我

# account.design.methods
source: Sign-in methods
ar: طرق تسجيل الدخول
zh_hans: 登录方式
zh_hant: 登入方式

# account.design.mismatch
source: The passwords don’t match.
ar: كلمتا المرور غير متطابقتين.
zh_hans: 两次输入的密码不一致。
zh_hant: 兩次輸入的密碼不一致。

# account.design.newPassword
source: New password
ar: كلمة المرور الجديدة
zh_hans: 新密码
zh_hant: 新密碼

# account.design.nickname
source: Display name
ar: الاسم الظاهر
zh_hans: 昵称
zh_hant: 暱稱

# account.design.nicknameRule
source: Up to 64 characters; can’t be only spaces.
ar: حتى 64 حرفًا، ولا يجوز أن يكون الاسم فراغات فقط.
zh_hans: 最多 64 个字符，不能全为空白。
zh_hant: 最多 64 個字元，不可全部為空白。

# account.design.noAccount
source: New to AzureFish?
ar: ليس لديك حساب؟
zh_hans: 还没有账号？
zh_hant: 還沒有帳號？

# account.design.notSet
source: Not set
ar: غير مُعدّ
zh_hans: 未设置
zh_hant: 未設定

# account.design.offline
source: You’re offline. Check your connection and try again. Your input is retained.
ar: لا يوجد اتصال بالشبكة. تحقق من الاتصال وأعد المحاولة. تبقى بياناتك المدخلة محفوظة.
zh_hans: 无法连接网络。请检查连接后重试，已填写内容会保留。
zh_hant: 無法連接網路。請檢查連線後重試，已填寫內容會保留。

# account.design.offlineProfile
source: Showing your offline profile. Changes can’t be saved yet. Appearance and language remain available.
ar: تُعرض نسخة ملفك دون اتصال. لا يمكن حفظ التغييرات الآن، وتبقى إعدادات المظهر واللغة متاحة.
zh_hans: 当前为离线资料，暂时无法保存修改。外观和语言仍可设置。
zh_hant: 目前為離線資料，暫時無法儲存修改。仍可設定外觀和語言。

# account.design.openApple
source: Open Apple authorization
ar: فتح تفويض Apple
zh_hans: 打开 Apple 授权
zh_hant: 開啟 Apple 授權

# account.design.openSettings
source: Open system settings
ar: فتح إعدادات النظام
zh_hans: 打开系统设置
zh_hant: 開啟系統設定

# account.design.operationError
source: The action wasn’t completed. Try again or cancel.
ar: لم يكتمل الإجراء. حاول مجددًا أو ألغِه.
zh_hans: 操作未完成，请重试或取消。
zh_hant: 操作未完成，請重試或取消。

# account.design.password
source: Password
ar: كلمة المرور
zh_hans: 密码
zh_hant: 密碼

# account.design.passwordChanged
source: Password changed. Please sign in again.
ar: تم تغيير كلمة المرور. يرجى تسجيل الدخول مجددًا.
zh_hans: 密码已修改，请重新登录。
zh_hant: 密碼已更改，請重新登入。

# account.design.passwordMethod
source: Account password
ar: كلمة مرور الحساب
zh_hans: 账号密码
zh_hant: 帳號密碼

# account.design.passwordRule
source: At least 12 characters and at most 72 UTF-8 bytes. Some characters use multiple bytes.
ar: 12 حرفًا على الأقل، وبحد أقصى 72 بايت بترميز UTF-8. قد يشغل الحرف عدة بايتات.
zh_hans: 至少 12 个字符，且不超过 72 个 UTF-8 字节。中文等字符可能占多个字节。
zh_hant: 至少 12 個字元，且不超過 72 個 UTF-8 位元組。中文等字元可能佔多個位元組。

# account.design.passwordSet
source: Account password set.
ar: تم إعداد كلمة مرور الحساب.
zh_hans: 账号密码已设置。
zh_hant: 帳號密碼已設定。

# account.design.photoImmediate
source: Photo changes take effect when confirmed. Cancelling text edits won’t undo them.
ar: تُحدَّث الصورة فور تأكيدها. إلغاء تعديل النص لا يلغي تغيير الصورة.
zh_hans: 头像确认后立即更新；取消文字编辑不会撤销头像修改。
zh_hant: 確認頭像後會立即更新；取消文字編輯不會撤銷頭像變更。

# account.design.photoPermission
source: Photo access unavailable
ar: الوصول إلى الصور غير متاح
zh_hans: 无法访问照片
zh_hant: 無法存取照片

# account.design.photoPermissionHelp
source: Allow photo access in system settings, then return and try again.
ar: اسمح بالوصول إلى الصور في إعدادات النظام، ثم عد وحاول مجددًا.
zh_hans: 请在系统设置中允许照片访问，然后返回重试。
zh_hant: 請在系統設定中允許取用照片，再返回重試。

# account.design.photoPreview
source: Preview photo
ar: معاينة الصورة
zh_hans: 头像预览
zh_hant: 頭像預覽

# account.design.processing
source: Working…
ar: جارٍ التنفيذ…
zh_hans: 正在处理…
zh_hant: 正在處理…

# account.design.reauth
source: Confirm your identity
ar: تأكيد هويتك
zh_hans: 确认是你本人
zh_hant: 確認是你本人

# account.design.reauthExpired
source: Identity confirmation expired. Confirm again. Your new password is temporarily retained.
ar: انتهت صلاحية تأكيد الهوية. أكدها مجددًا؛ ستبقى كلمة المرور الجديدة مؤقتًا.
zh_hans: 身份确认已过期，请重新确认。已填写的新密码会暂时保留。
zh_hant: 身分確認已過期，請重新確認。已填寫的新密碼會暫時保留。

# account.design.reauthHelp
source: Confirm your identity before continuing this action.
ar: أكد هويتك قبل متابعة هذا الإجراء لحماية حسابك.
zh_hans: 为保护账号安全，请先确认身份，再继续本次操作。
zh_hant: 為保護帳號安全，請先確認身分，再繼續本次操作。

# account.design.reauthorize
source: Authorize again
ar: إعادة التفويض
zh_hans: 重新授权
zh_hant: 重新授權

# account.design.recovery
source: Recovery guidance
ar: إرشادات الاستعادة
zh_hans: 恢复说明
zh_hant: 復原說明

# account.design.recoveryHelp
source: Keep existing data. Unlock the device and retry. If it remains unavailable, preserve the original files and seek support. Do not overwrite them.
ar: احتفظ ببياناتك. افتح قفل الجهاز وحاول مجددًا. إذا استمرت المشكلة، حافظ على الملفات الأصلية واطلب الدعم دون استبدالها.
zh_hans: 保留当前数据。确认设备已解锁后重试；若仍不可用，请保留原文件并寻求支持。不要覆盖或重建为空数据。
zh_hant: 保留目前資料。確認裝置已解鎖後重試；若仍無法使用，請保留原始檔案並尋求支援。請勿覆寫或重建為空白資料。

# account.design.register
source: Create account
ar: إنشاء حساب
zh_hans: 注册账号
zh_hant: 註冊帳號

# account.design.registerHelp
source: Create an account and set up your profile.
ar: أنشئ حسابًا وأعدّ ملفك الشخصي.
zh_hans: 创建账号，设置你的个人资料。
zh_hant: 建立帳號，設定你的個人資料。

# account.design.reload
source: Load latest profile
ar: تحميل أحدث نسخة
zh_hans: 载入最新资料
zh_hant: 載入最新資料

# account.design.restoreHelp
source: Your current photo will be removed.
ar: ستُزال صورتك الحالية.
zh_hans: 恢复默认后，当前头像会被移除。
zh_hant: 恢復預設後，目前的頭像將被移除。

# account.design.restorePhoto
source: Use default photo
ar: استخدام الصورة الافتراضية
zh_hans: 恢复默认头像
zh_hant: 恢復預設頭像

# account.design.retry
source: Try again
ar: إعادة المحاولة
zh_hans: 重试
zh_hant: 重試

# account.design.reviewSave
source: Review and save again
ar: المراجعة والحفظ مجددًا
zh_hans: 重新确认并保存
zh_hant: 重新確認並儲存

# account.design.revoked
source: Authorization expired
ar: انتهى التفويض
zh_hans: 授权已失效
zh_hant: 授權已失效

# account.design.save
source: Save
ar: حفظ
zh_hans: 保存
zh_hant: 儲存

# account.design.saveError
source: Couldn’t save. Your edits are retained. Try again.
ar: تعذّر الحفظ. تبقى تعديلاتك موجودة؛ حاول مجددًا.
zh_hans: 保存失败。修改内容已保留，请重试。
zh_hant: 儲存失敗。修改內容已保留，請重試。

# account.design.saved
source: Profile saved
ar: تم حفظ الملف الشخصي
zh_hans: 资料已保存
zh_hant: 資料已儲存

# account.design.saving
source: Saving…
ar: جارٍ الحفظ…
zh_hans: 正在保存…
zh_hant: 正在儲存…

# account.design.security
source: Account & security
ar: الحساب والأمان
zh_hans: 账号与安全
zh_hant: 帳號與安全

# account.design.sessionExpired
source: Session expired
ar: انتهت جلسة الدخول
zh_hans: 登录已失效
zh_hant: 登入已失效

# account.design.sessionHelp
source: Please sign in again to continue.
ar: يرجى تسجيل الدخول مجددًا للمتابعة.
zh_hans: 请重新登录以继续。
zh_hant: 請重新登入以繼續。

# account.design.setPassword
source: Set account password
ar: إعداد كلمة مرور الحساب
zh_hans: 设置账号密码
zh_hant: 設定帳號密碼

# account.design.settings
source: App settings
ar: إعدادات التطبيق
zh_hans: 应用设置
zh_hant: App 設定

# account.design.showPassword
source: Show password
ar: إظهار كلمة المرور
zh_hans: 显示密码
zh_hant: 顯示密碼

# account.design.signIn
source: Sign in
ar: دخول
zh_hans: 登录
zh_hant: 登入

# account.design.signOut
source: Sign out
ar: تسجيل الخروج
zh_hans: 退出登录
zh_hant: 登出

# account.design.signOutAll
source: Sign out all devices
ar: الخروج من جميع الأجهزة
zh_hans: 退出全部设备
zh_hant: 登出所有裝置

# account.design.staticPhoto
source: Please choose a still photo.
ar: يرجى اختيار صورة ثابتة.
zh_hans: 请选择静态照片。
zh_hant: 請選擇靜態照片。

# account.design.storageHelp
source: Local data couldn’t be read securely. Retry or review recovery guidance. Existing data will not be replaced with an empty profile.
ar: تعذّر قراءة البيانات المحلية بأمان. أعد المحاولة أو راجع إرشادات الاستعادة. لن تُستبدل بياناتك بملف فارغ.
zh_hans: 无法安全读取本机资料。请重试或查看恢复说明，原有数据不会被空资料覆盖。
zh_hant: 無法安全讀取本機資料。請重試或查看復原說明，原有資料不會被空白資料覆寫。

# account.design.storageUnavailable
source: Local data unavailable
ar: البيانات المحلية غير متاحة
zh_hans: 本机资料暂不可用
zh_hant: 本機資料暫時無法使用

# account.design.switchAccount
source: Switch account
ar: تبديل الحساب
zh_hans: 切换账号
zh_hant: 切換帳號

# account.design.system
source: System default
ar: حسب النظام
zh_hans: 跟随系统
zh_hant: 跟隨系統

# account.design.systemHandoff
source: The system authorization screen opens next. Cancelling returns you here.
ar: ستفتح شاشة تفويض النظام. عند الإلغاء ستعود إلى هذه الصفحة.
zh_hans: 接下来将打开系统授权界面。取消后会返回当前页面。
zh_hant: 接下來將開啟系統授權介面。取消後會返回目前頁面。

# account.design.tagline
source: Sign in and start a conversation.
ar: سجّل الدخول وابدأ المحادثة.
zh_hans: 登录账号，开始交流
zh_hant: 登入帳號，開始交流

# account.design.taken
source: That account name is taken. Choose another.
ar: اسم الحساب مستخدم بالفعل. اختر اسمًا آخر.
zh_hans: 该账号已被使用，请换一个。
zh_hant: 此帳號已被使用，請換一個。

# account.design.timeout
source: The request timed out. Try again; your input is retained.
ar: انتهت مهلة الطلب. أعد المحاولة؛ لن تفقد ما أدخلته.
zh_hans: 请求超时，请重试。已填写内容会保留。
zh_hant: 要求逾時，請重試。已填寫內容會保留。

# account.design.unbindApple
source: Unlink Apple
ar: إلغاء ربط Apple
zh_hans: 解除 Apple 关联
zh_hant: 解除 Apple 連結

# account.design.unbindHelp
source: Make sure your account password works. If you signed in with Apple, unlinking requires you to sign in again with your password.
ar: تأكد من إمكانية الدخول بكلمة المرور. إذا دخلت باستخدام Apple، فستحتاج إلى الدخول مجددًا بكلمة المرور بعد إلغاء الربط.
zh_hans: 解除关联前请确认账号密码可用。如果当前使用 Apple 登录，解除后需要用密码重新登录。
zh_hant: 解除連結前請確認帳號密碼可用。若目前使用 Apple 登入，解除後需使用密碼重新登入。

# account.design.unbinding
source: Unlinking…
ar: جارٍ إلغاء الربط…
zh_hans: 正在解除关联…
zh_hant: 正在解除連結…

# account.design.unbound
source: Not linked
ar: غير مرتبط
zh_hans: 未绑定
zh_hant: 未連結

# account.design.uploadFailed
source: Upload failed. Your previous photo is unchanged. Try again.
ar: فشل الرفع. لم تتغير صورتك السابقة. يمكنك إعادة المحاولة.
zh_hans: 头像上传失败，原头像未改变。你可以重试。
zh_hant: 頭像上傳失敗，原頭像未變更。你可以重試。

# account.design.uploading
source: Uploading photo…
ar: جارٍ رفع الصورة…
zh_hans: 正在上传头像…
zh_hant: 正在上傳頭像…

# account.design.usePhoto
source: Use this photo
ar: استخدام هذه الصورة
zh_hans: 使用此头像
zh_hant: 使用此頭像

# account.design.welcome
source: Welcome to AzureFish
ar: مرحبًا بك في AzureFish
zh_hans: 欢迎来到 AzureFish
zh_hant: 歡迎來到 AzureFish

# account.error
source: The action wasn’t completed. Try again or cancel.
ar: لم يكتمل الإجراء. حاول مجددًا أو ألغِه.
zh_hans: 操作未完成，请重试或取消。
zh_hant: 操作未完成，請重試或取消。

# account.expired
source: Please sign in again to continue.
ar: يرجى تسجيل الدخول مجددًا للمتابعة.
zh_hans: 请重新登录以继续。
zh_hant: 請重新登入以繼續。

# account.offline
source: You’re offline. Check your connection and try again. Your input is retained.
ar: لا يوجد اتصال بالشبكة. تحقق من الاتصال وأعد المحاولة. تبقى بياناتك المدخلة محفوظة.
zh_hans: 无法连接网络。请检查连接后重试，已填写内容会保留。
zh_hant: 無法連接網路。請檢查連線後重試，已填寫內容會保留。

# account.operation.expired
source: The recovery window for this action expired. Review before starting again.
ar: انتهت مهلة استعادة هذا الإجراء. راجع البيانات قبل البدء مجددًا.
zh_hans: 本次操作恢复期限已过，请重新确认后提交。
zh_hant: 本次操作的復原期限已過，請重新確認後送出。

# account.password.available
source: Account password · Set up
ar: كلمة مرور الحساب · تم الإعداد
zh_hans: 账号密码 · 已设置
zh_hant: 帳號密碼 · 已設定

# account.rate.limit
source: Too many attempts. Please try again later.
ar: محاولات كثيرة جدًا. حاول لاحقًا.
zh_hans: 操作过于频繁，请稍后重试。
zh_hant: 操作過於頻繁，請稍後重試。

# account.saved.storage
source: Saved on the server. Local storage is unavailable. Do not resubmit; retry loading the profile.
ar: تم الحفظ على الخادم. التخزين المحلي غير متاح. لا تُعد الإرسال؛ حاول تحميل الملف مجددًا.
zh_hans: 服务器已保存。本机存储不可用，请勿重复提交；可重试读取资料。
zh_hant: 伺服器已儲存。本機儲存空間無法使用，請勿重複送出；可重試讀取資料。

# account.security.configured
source: Set up
ar: تم الإعداد
zh_hans: 已设置
zh_hant: 已設定

# account.security.methodsHelp
source: Sign in with your current password. Security actions require password verification.
ar: سجّل الدخول بكلمة المرور الحالية. تتطلب إجراءات الأمان التحقق من كلمة المرور.
zh_hans: 使用当前密码登录。安全操作需要再次确认密码。
zh_hant: 使用目前密碼登入。安全操作需要再次確認密碼。

# account.security.operations
source: Security actions
ar: إجراءات الأمان
zh_hans: 安全操作
zh_hant: 安全操作

# account.security.password
source: Account password
ar: كلمة مرور الحساب
zh_hans: 账号密码
zh_hant: 帳號密碼

# account.security.unavailable
source: Not available yet
ar: غير متاح بعد
zh_hans: 暂未开放
zh_hant: 暫未開放

# account.storage
source: Local data couldn’t be read securely. Retry or review recovery guidance. Existing data will not be replaced with an empty profile.
ar: تعذّر قراءة البيانات المحلية بأمان. أعد المحاولة أو راجع إرشادات الاستعادة. لن تُستبدل بياناتك بملف فارغ.
zh_hans: 无法安全读取本机资料。请重试或查看恢复说明，原有数据不会被空资料覆盖。
zh_hant: 無法安全讀取本機資料。請重試或查看復原說明，原有資料不會被空白資料覆寫。

# account.taken
source: That account name is taken. Choose another.
ar: اسم الحساب مستخدم بالفعل. اختر اسمًا آخر.
zh_hans: 该账号已被使用，请换一个。
zh_hant: 此帳號已被使用，請換一個。

# account.unavailable
source: Account service is not configured. This build supports fictional accounts on Simulator only.
ar: خدمة الحساب غير مهيأة. يدعم هذا الإصدار حسابات تجريبية على المحاكي فقط.
zh_hans: 账号服务未配置。当前版本仅支持模拟器虚构账号联调。
zh_hant: 尚未設定帳號服務。目前版本僅支援模擬器虛構帳號測試。

# account.unavailable.feature
source: This feature is not available yet.
ar: هذه الميزة غير متاحة بعد.
zh_hans: 此功能暂未开放。
zh_hant: 此功能暫未開放。

# account.validation
source: Check the account name, password, display name and bio requirements.
ar: تحقق من متطلبات اسم الحساب وكلمة المرور والاسم الظاهر والنبذة.
zh_hans: 请检查账号、密码、昵称和简介是否符合规则。
zh_hant: 請確認帳號、密碼、暱稱與簡介符合規則。

# common.boolean.false
source: No
ar: لا
zh_hans: 否
zh_hant: 否

# common.boolean.true
source: Yes
ar: نعم
zh_hans: 是
zh_hant: 是

# common.close
source: Close
ar: إغلاق
zh_hans: 关闭
zh_hant: 關閉

# common.ok
source: OK
ar: حسناً
zh_hans: 确定
zh_hant: 確定

# common.submit
source: Submit
ar: إرسال
zh_hans: 提交
zh_hant: 送出

# demo.imessage.title
source: iMessage Chat
ar: دردشة بنمط iMessage
zh_hans: iMessage 风格聊天
zh_hant: iMessage 風格聊天

# imessage.action.cancel
source: Cancel
ar: إلغاء
zh_hans: 取消
zh_hant: 取消

# imessage.action.ok
source: OK
ar: حسنًا
zh_hans: 好
zh_hant: 好

# imessage.action.settings
source: Settings
ar: الإعدادات
zh_hans: 前往设置
zh_hant: 前往設定

# imessage.attachment.add
source: Add attachment
ar: إضافة مرفق
zh_hans: 添加附件
zh_hant: 加入附件

# imessage.attachment.audio
source: Audio
ar: صوت
zh_hans: 音频
zh_hant: 音訊

# imessage.attachment.file
source: Files
ar: الملفات
zh_hans: 文件
zh_hant: 檔案

# imessage.attachment.importFailed
source: Import failed. Remove and try again.
ar: فشل الاستيراد. أزل الملف وحاول مجددًا.
zh_hans: 导入失败，请移除后重试。
zh_hant: 無法匯入，請移除後重試。

# imessage.attachment.link
source: Link
ar: رابط
zh_hans: 链接
zh_hant: 連結

# imessage.attachment.pastedFile
source: Pasted Attachment
ar: مرفق ملصق
zh_hans: 粘贴的附件
zh_hant: 貼上的附件

# imessage.attachment.photo
source: Photos
ar: الصور
zh_hans: 照片
zh_hant: 照片

# imessage.audio.attachment.recording
source: Recording
ar: تسجيل
zh_hans: 录音
zh_hant: 錄音

# imessage.audio.cancel
source: Cancel audio
ar: إلغاء الصوت
zh_hans: 取消音频
zh_hant: 取消音訊

# imessage.audio.pause
source: Pause audio
ar: إيقاف الصوت مؤقتًا
zh_hans: 暂停音频
zh_hant: 暫停音訊

# imessage.audio.play
source: Play audio
ar: تشغيل الصوت
zh_hans: 播放音频
zh_hant: 播放音訊

# imessage.audio.record.requiresEmptyDraft
source: To record audio, clear the input field.
ar: لتسجيل الصوت، أفرغ حقل الإدخال.
zh_hans: 若要录音，请清除输入栏。
zh_hant: 若要錄音，請清除輸入欄。

# imessage.audio.record.stop
source: Stop recording
ar: إيقاف التسجيل
zh_hans: 停止录音
zh_hant: 停止錄音

# imessage.composer.mediaPlaceholder
source: Add a comment or send
ar: أضف تعليقًا أو أرسل
zh_hans: 添加注释或发送
zh_hant: 加入註解或傳送

# imessage.composer.send
source: Send
ar: إرسال
zh_hans: 发送
zh_hant: 傳送

# imessage.dictation.start
source: Dictate
ar: إملاء
zh_hans: 语音输入
zh_hant: 語音輸入

# imessage.dictation.stop
source: Stop dictation
ar: إيقاف الإملاء
zh_hans: 停止语音输入
zh_hant: 停止語音輸入

# imessage.draft.partialRestore
source: Some draft attachments couldn’t be restored
ar: تعذر استعادة بعض مرفقات المسودة
zh_hans: 部分草稿附件无法恢复
zh_hant: 部分草稿附件無法復原

# imessage.draft.restoreFailed
source: Couldn’t restore draft
ar: تعذر استعادة المسودة
zh_hans: 草稿无法恢复
zh_hant: 草稿無法復原

# imessage.draft.saveFailed
source: Couldn’t save draft
ar: تعذر حفظ المسودة
zh_hans: 草稿保存失败
zh_hant: 草稿儲存失敗

# imessage.error.mediaImportFailed
source: This item couldn't be imported. The rest of your selection was kept.
ar: تعذر استيراد هذا العنصر. تم الاحتفاظ ببقية التحديد.
zh_hans: 无法导入这个项目，已保留其余选择。
zh_hant: 無法匯入此項目，已保留其他選取項目。

# imessage.error.mediaInvalid
source: The selected media is no longer valid. Your draft was kept so you can try again.
ar: لم تعد الوسائط المحددة صالحة. تم الاحتفاظ بالمسودة لتتمكن من المحاولة مجددًا.
zh_hans: 所选媒体已失效，草稿已保留，请重试。
zh_hant: 所選媒體已失效，草稿已保留，請重試。

# imessage.error.microphonePermission
source: Allow microphone access in Settings to record audio or use dictation.
ar: اسمح بالوصول إلى الميكروفون في الإعدادات لتسجيل الصوت أو استخدام الإملاء.
zh_hans: 请在“设置”中允许麦克风访问，以录制音频或使用语音输入。
zh_hant: 請在「設定」中允許使用麥克風，以錄製音訊或使用語音輸入。

# imessage.error.playbackFailed
source: This audio message couldn't be played.
ar: تعذر تشغيل هذه الرسالة الصوتية.
zh_hans: 无法播放这条音频消息。
zh_hant: 無法播放這則語音訊息。

# imessage.error.recordingFailed
source: The audio message couldn't be recorded. Try again.
ar: تعذر تسجيل الرسالة الصوتية. حاول مرة أخرى.
zh_hans: 无法录制音频消息，请重试。
zh_hant: 無法錄製語音訊息，請重試。
